Revit 2024 API
ElementDesignOptionFilter.DesignOptionId Property
 The design option id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId DesignOptionId { get; }
Visual Basic
Public ReadOnly Property DesignOptionId As ElementId
	Get
Visual C++
public:
property ElementId^ DesignOptionId {
	ElementId^ get ();
}
See Also
ElementDesignOptionFilter Class
Autodesk.Revit.DB Namespace